dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_modem.h
__STATIC_FORCEINLINE void mdm_pe_powerthr_setf(uint8_t pepowerthr)
{
    ASSERT_ERR((((uint32_t)pepowerthr << 0) & ~((uint32_t)0x0000003F)) == 0);
    REG_RPL_WR(MDM_PE_POWERTHR_ADDR, (uint32_t)pepowerthr << 0);
}

/**
 * @brief DPLATENCY_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  17:16             DPL_TUNE   0x2
 *  09:00            GB_LENGTH   0x0
 * </pre>
 */
#define MDM_DPLATENCY_CNTL_ADDR   0x000000AC
#define MDM_DPLATENCY_CNTL_OFFSET 0x000000AC
#define MDM_DPLATENCY_CNTL_INDEX  0x0000002B
#define MDM_DPLATENCY_CNTL_RESET  0x00020000

__STATIC_FORCEINLINE uint32_t mdm_dplatency_cntl_get(void)
{
    return REG_RPL_RD(MDM_DPLATENCY_CNTL_ADDR);
}

__STATIC_FORCEINLINE void mdm_dplatency_cntl_set(uint32_t value)
{
    REG_RPL_WR(MDM_DPLATENCY_CNTL_ADDR, value);
}

// field definitions
#define MDM_DPL_TUNE_MASK    ((uint32_t)0x00030000)
#define MDM_DPL_TUNE_LSB     16
#define MDM_DPL_TUNE_WIDTH   ((uint32_t)0x00000002)
#define MDM_GB_LENGTH_MASK   ((uint32_t)0x000003FF)
#define MDM_GB_LENGTH_LSB    0
#define MDM_GB_LENGTH_WIDTH  ((uint32_t)0x0000000A)

#define MDM_DPL_TUNE_RST     0x2
#define MDM_GB_LENGTH_RST    0x0

__STATIC_FORCEINLINE void mdm_dplatency_cntl_unpack(uint8_t* dpltune, uint16_t* gblength)
{
    uint32_t localVal = REG_RPL_RD(MDM_DPLATENCY_CNTL_ADDR);

    *dpltune = (localVal & ((uint32_t)0x00030000)) >> 16;
    *gblength = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t mdm_dpl_tune_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_DPLATENCY_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

__STATIC_FORCEINLINE void mdm_dpl_tune_setf(uint8_t dpltune)
{
    ASSERT_ERR((((uint32_t)dpltune << 16) & ~((uint32_t)0x00030000)) == 0);
    REG_RPL_WR(MDM_DPLATENCY_CNTL_ADDR, (uint32_t)dpltune << 16);
}

__STATIC_FORCEINLINE uint16_t mdm_gb_length_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_DPLATENCY_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

/**
 * @brief RXDPSK_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  19:08             RRC_GAIN   0x0
 *     07           RRC_ENGAIN   1
 *     02               COC_EN   1
 *     01            DFD_ENFOT   1
 *     00               FOE_EN   1
 * </pre>
 */
#define MDM_RXDPSK_CNTL_ADDR   0x000000B0
#define MDM_RXDPSK_CNTL_OFFSET 0x000000B0
#define MDM_RXDPSK_CNTL_INDEX  0x0000002C
#define MDM_RXDPSK_CNTL_RESET  0x00000087

__STATIC_FORCEINLINE uint32_t mdm_rxdpsk_cntl_get(void)
{
    return REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
}

__STATIC_FORCEINLINE void mdm_rxdpsk_cntl_set(uint32_t value)
{
    REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR, value);
}

// field definitions
#define MDM_RRC_GAIN_MASK     ((uint32_t)0x000FFF00)
#define MDM_RRC_GAIN_LSB      8
#define MDM_RRC_GAIN_WIDTH    ((uint32_t)0x0000000C)
#define MDM_RRC_ENGAIN_BIT    ((uint32_t)0x00000080)
#define MDM_RRC_ENGAIN_POS    7
#define MDM_COC_EN_BIT        ((uint32_t)0x00000004)
#define MDM_COC_EN_POS        2
#define MDM_DFD_ENFOT_BIT     ((uint32_t)0x00000002)
#define MDM_DFD_ENFOT_POS     1
#define MDM_FOE_EN_BIT        ((uint32_t)0x00000001)
#define MDM_FOE_EN_POS        0

#define MDM_RRC_GAIN_RST      0x0
#define MDM_RRC_ENGAIN_RST    0x1
#define MDM_COC_EN_RST        0x1
#define MDM_DFD_ENFOT_RST     0x1
#define MDM_FOE_EN_RST        0x1

__STATIC_FORCEINLINE void mdm_rxdpsk_cntl_pack(uint16_t rrcgain, uint8_t rrcengain, uint8_t cocen, uint8_t dfdenfot, uint8_t foeen)
{
    ASSERT_ERR((((uint32_t)rrcgain << 8) & ~((uint32_t)0x000FFF00)) == 0);
    ASSERT_ERR((((uint32_t)rrcengain << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)cocen << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dfdenfot << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)foeen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR,  ((uint32_t)rrcgain << 8) | ((uint32_t)rrcengain << 7) | ((uint32_t)cocen << 2) | ((uint32_t)dfdenfot << 1) | ((uint32_t)foeen << 0));
}

__STATIC_FORCEINLINE void mdm_rxdpsk_cntl_unpack(uint16_t* rrcgain, uint8_t* rrcengain, uint8_t* cocen, uint8_t* dfdenfot, uint8_t* foeen)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);

    *rrcgain = (localVal & ((uint32_t)0x000FFF00)) >> 8;
    *rrcengain = (localVal & ((uint32_t)0x00000080)) >> 7;
    *cocen = (localVal & ((uint32_t)0x00000004)) >> 2;
    *dfdenfot = (localVal & ((uint32_t)0x00000002)) >> 1;
    *foeen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint16_t mdm_rrc_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x000FFF00)) >> 8);
}

__STATIC_FORCEINLINE void mdm_rrc_gain_setf(uint16_t rrcgain)
{
    ASSERT_ERR((((uint32_t)rrcgain << 8) & ~((uint32_t)0x000FFF00)) == 0);
    REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR, (REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR) & ~((uint32_t)0x000FFF00)) | ((uint32_t)rrcgain << 8));
}

__STATIC_FORCEINLINE uint8_t mdm_rrc_engain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__STATIC_FORCEINLINE void mdm_rrc_engain_setf(uint8_t rrcengain)
{
    ASSERT_ERR((((uint32_t)rrcengain << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR, (REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)rrcengain << 7));
}

__STATIC_FORCEINLINE uint8_t mdm_coc_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__STATIC_FORCEINLINE void mdm_coc_en_setf(uint8_t cocen)
{
    ASSERT_ERR((((uint32_t)cocen << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(MDM_RXDPSK_CNTL_ADDR, (REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)cocen << 2));
}

__STATIC_FORCEINLINE uint8_t mdm_dfd_enfot_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXDPSK_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

