dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_modem.h
// field definitions
#define MDM_COC_THR_MASK   ((uint32_t)0x000003FF)
#define MDM_COC_THR_LSB    0
#define MDM_COC_THR_WIDTH  ((uint32_t)0x0000000A)

#define MDM_COC_THR_RST    0x200

__STATIC_FORCEINLINE uint16_t mdm_coc_thr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_COC_THR_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000003FF)) == 0);
    return (localVal >> 0);
}

__STATIC_FORCEINLINE void mdm_coc_thr_setf(uint16_t cocthr)
{
    ASSERT_ERR((((uint32_t)cocthr << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(MDM_COC_THR_ADDR, (uint32_t)cocthr << 0);
}

/**
 * @brief COC_TD register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  08:00               COC_TD   0x32
 * </pre>
 */
#define MDM_COC_TD_ADDR   0x000000B5
#define MDM_COC_TD_OFFSET 0x000000B5
#define MDM_COC_TD_INDEX  0x0000002D
#define MDM_COC_TD_RESET  0x00000032

__STATIC_FORCEINLINE uint32_t mdm_coc_td_get(void)
{
    return REG_RPL_RD(MDM_COC_TD_ADDR);
}

__STATIC_FORCEINLINE void mdm_coc_td_set(uint32_t value)
{
    REG_RPL_WR(MDM_COC_TD_ADDR, value);
}

// field definitions
#define MDM_COC_TD_MASK   ((uint32_t)0x000001FF)
#define MDM_COC_TD_LSB    0
#define MDM_COC_TD_WIDTH  ((uint32_t)0x00000009)

#define MDM_COC_TD_RST    0x32

__STATIC_FORCEINLINE uint16_t mdm_coc_td_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_COC_TD_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000001FF)) == 0);
    return (localVal >> 0);
}

__STATIC_FORCEINLINE void mdm_coc_td_setf(uint16_t coctd)
{
    ASSERT_ERR((((uint32_t)coctd << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(MDM_COC_TD_ADDR, (uint32_t)coctd << 0);
}

/**
 * @brief COC_TENABLE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:00          COC_TENABLE   0x19
 * </pre>
 */
#define MDM_COC_TENABLE_ADDR   0x000000B6
#define MDM_COC_TENABLE_OFFSET 0x000000B6
#define MDM_COC_TENABLE_INDEX  0x0000002D
#define MDM_COC_TENABLE_RESET  0x00000019

__STATIC_FORCEINLINE uint32_t mdm_coc_tenable_get(void)
{
    return REG_RPL_RD(MDM_COC_TENABLE_ADDR);
}

__STATIC_FORCEINLINE void mdm_coc_tenable_set(uint32_t value)
{
    REG_RPL_WR(MDM_COC_TENABLE_ADDR, value);
}

// field definitions
#define MDM_COC_TENABLE_MASK   ((uint32_t)0x000000FF)
#define MDM_COC_TENABLE_LSB    0
#define MDM_COC_TENABLE_WIDTH  ((uint32_t)0x00000008)

#define MDM_COC_TENABLE_RST    0x19

__STATIC_FORCEINLINE uint8_t mdm_coc_tenable_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_COC_TENABLE_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000000FF)) == 0);
    return (localVal >> 0);
}

__STATIC_FORCEINLINE void mdm_coc_tenable_setf(uint8_t coctenable)
{
    ASSERT_ERR((((uint32_t)coctenable << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(MDM_COC_TENABLE_ADDR, (uint32_t)coctenable << 0);
}

/**
 * @brief POW_DIGGAINOFF register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  03:00        PE_DIGGAINOFF   0x0
 * </pre>
 */
#define MDM_POW_DIGGAINOFF_ADDR   0x000000B7
#define MDM_POW_DIGGAINOFF_OFFSET 0x000000B7
#define MDM_POW_DIGGAINOFF_INDEX  0x0000002D
#define MDM_POW_DIGGAINOFF_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t mdm_pow_diggainoff_get(void)
{
    return REG_RPL_RD(MDM_POW_DIGGAINOFF_ADDR);
}

__STATIC_FORCEINLINE void mdm_pow_diggainoff_set(uint32_t value)
{
    REG_RPL_WR(MDM_POW_DIGGAINOFF_ADDR, value);
}

// field definitions
#define MDM_PE_DIGGAINOFF_MASK   ((uint32_t)0x0000000F)
#define MDM_PE_DIGGAINOFF_LSB    0
#define MDM_PE_DIGGAINOFF_WIDTH  ((uint32_t)0x00000004)

#define MDM_PE_DIGGAINOFF_RST    0x0

__STATIC_FORCEINLINE uint8_t mdm_pe_diggainoff_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_POW_DIGGAINOFF_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000000F)) == 0);
    return (localVal >> 0);
}

__STATIC_FORCEINLINE void mdm_pe_diggainoff_setf(uint8_t pediggainoff)
{
    ASSERT_ERR((((uint32_t)pediggainoff << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(MDM_POW_DIGGAINOFF_ADDR, (uint32_t)pediggainoff << 0);
}

/**
 * @brief FOE_STATUS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:16             FOE_REAL   0x0
 *  09:00             FOE_IMAG   0x0
 * </pre>
 */
#define MDM_FOE_STATUS_ADDR   0x000000B8
#define MDM_FOE_STATUS_OFFSET 0x000000B8
#define MDM_FOE_STATUS_INDEX  0x0000002E
#define MDM_FOE_STATUS_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t mdm_foe_status_get(void)
{
    return REG_RPL_RD(MDM_FOE_STATUS_ADDR);
}

__STATIC_FORCEINLINE void mdm_foe_status_set(uint32_t value)
{
    REG_RPL_WR(MDM_FOE_STATUS_ADDR, value);
}

// field definitions
#define MDM_FOE_REAL_MASK   ((uint32_t)0x03FF0000)
#define MDM_FOE_REAL_LSB    16
#define MDM_FOE_REAL_WIDTH  ((uint32_t)0x0000000A)
#define MDM_FOE_IMAG_MASK   ((uint32_t)0x000003FF)
#define MDM_FOE_IMAG_LSB    0
#define MDM_FOE_IMAG_WIDTH  ((uint32_t)0x0000000A)

#define MDM_FOE_REAL_RST    0x0
#define MDM_FOE_IMAG_RST    0x0

__STATIC_FORCEINLINE void mdm_foe_status_unpack(uint16_t* foereal, uint16_t* foeimag)
{
    uint32_t localVal = REG_RPL_RD(MDM_FOE_STATUS_ADDR);

    *foereal = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *foeimag = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t mdm_foe_real_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_FOE_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__STATIC_FORCEINLINE uint16_t mdm_foe_imag_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_FOE_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

/**
 * @brief TECOC_STATUS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  02:00             TE_INDEX   0x0
 * </pre>
 */
#define MDM_TECOC_STATUS_ADDR   0x000000B9
#define MDM_TECOC_STATUS_OFFSET 0x000000B9
#define MDM_TECOC_STATUS_INDEX  0x0000002E
#define MDM_TECOC_STATUS_RESET  0x00000000

