dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/driver/ble/reg_modem.h
// field definitions
#define MDM_DSG_DEN_MASK   ((uint32_t)0x0000000F)
#define MDM_DSG_DEN_LSB    0
#define MDM_DSG_DEN_WIDTH  ((uint32_t)0x00000004)

#define MDM_DSG_DEN_RST    0x0

__STATIC_FORCEINLINE uint8_t mdm_dsg_den_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_DSG_DEN_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000000F)) == 0);
    return (localVal >> 0);
}

__STATIC_FORCEINLINE void mdm_dsg_den_setf(uint8_t dsgden)
{
    ASSERT_ERR((((uint32_t)dsgden << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(MDM_DSG_DEN_ADDR, (uint32_t)dsgden << 0);
}

/**
 * @brief DSG_NOM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:00              DSG_NOM   0x1
 * </pre>
 */
#define MDM_DSG_NOM_ADDR   0x000000D1
#define MDM_DSG_NOM_OFFSET 0x000000D1
#define MDM_DSG_NOM_INDEX  0x00000034
#define MDM_DSG_NOM_RESET  0x00000001

__STATIC_FORCEINLINE uint32_t mdm_dsg_nom_get(void)
{
    return REG_RPL_RD(MDM_DSG_NOM_ADDR);
}

__STATIC_FORCEINLINE void mdm_dsg_nom_set(uint32_t value)
{
    REG_RPL_WR(MDM_DSG_NOM_ADDR, value);
}

// field definitions
#define MDM_DSG_NOM_MASK   ((uint32_t)0x000003FF)
#define MDM_DSG_NOM_LSB    0
#define MDM_DSG_NOM_WIDTH  ((uint32_t)0x0000000A)

#define MDM_DSG_NOM_RST    0x1

__STATIC_FORCEINLINE uint16_t mdm_dsg_nom_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_DSG_NOM_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000003FF)) == 0);
    return (localVal >> 0);
}

__STATIC_FORCEINLINE void mdm_dsg_nom_setf(uint16_t dsgnom)
{
    ASSERT_ERR((((uint32_t)dsgnom << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(MDM_DSG_NOM_ADDR, (uint32_t)dsgnom << 0);
}


#endif // _REG_MODEM_H_

